# Задание - 1
# Вам даны 2 списка одинаковой длины, в первом списке имена людей, во втором зарплаты,
# вам необходимо получить на выходе словарь, где ключ - имя, значение - зарплата.
# Запишите результаты в файл salary.txt так, чтобы на каждой строке было 2 столбца,
# столбцы разделяются пробелом, тире, пробелом. в первом имя, во втором зарплата, например: Vasya - 5000
# После чего прочитайте файл, выведите построчно имя и зарплату минус 13% (налоги ведь),
# Есть условие, не отображать людей получающих более зарплату 500000, как именно
#  выполнить условие решать вам, можете не писать в файл
# можете не выводить, подумайте какой способ будет наиболее правильным и оптимальным,
#  если скажем эти файлы потом придется передавать.
# Так же при выводе имя должно быть полностью в верхнем регистре!
# Подумайте вспоминая урок, как это можно сделать максимально кратко, используя возможности языка Python.


separator = ' - '

lst1 = ['Vasya', 'Petya', 'Mikhail']
lst2 = [80000, 600000, 100000]
dct = dict(zip(lst1, lst2))

with open('salary.txt', 'w', encoding='utf-8') as file:
    for key, value in dct.items():
        file.write(key + separator + str(value) + '\n')

dct2 = {}
with open('salary.txt', 'r', encoding='utf-8') as file:
    for line in file:
        name, salary = line.replace('\n', '').split(separator)
        dct2[name] = salary

dct2 = dict(zip(dct2.keys(), list(map(lambda x: 0.87 * float(x), dct2.values()))))
dct2 = dict((k, v) for k, v in dct2.items() if v < 500000)
print(dct2)